<template>
	<view class="">
		<view class="title">租车合同</view>
		<scroll-view class="content" :scroll-y="true" :style="{height: `${windowHeight*0.65}px`}">经友好协商，《租车合同》及附件《租车单》签字各方就车辆租赁事宜达成如下协议：一、出租方的权利和义务
1.1出租方和承租方关于租赁车辆、租期、价款、取还车日期等具体内容在小程序、网站、APP、门店及《租车单》《验车单》中约定。《租车单》、《验车单》、
《租车合同》及其它相关附件等，是本合同的组成部分，具有同等法律效力。
1.2出租方作为追风租车全国连锁伙伴，承诺按照追风租车自有小程序或合作品牌小程序、网站、APP、门店等公共信息发布渠道公示的服务标准，为承租方提供本合同项下的汽车租赁服务。
1.3 出租方享有承租车辆的所有权或使用权，出租方有权通过合理方式随时检查承租车辆的使用情况和安全状态，承租方需随时配合出租方对车辆状态进行抽检。 出租方有权根据车辆专用 GPS
查询车辆定位状态，当车辆出现以下状态时：1）非正常离线或者异常拆除报警；2）承租方失联或无法提供车辆位置、拒绝出租方对车辆位置的核实；3）超出允许行驶区域；4）其他非因出租方的原因查找不到车辆位置的情况，承租方认同出租方即可根据上述状态认定车辆丢失或者被盗，认同出租方将立刻寻求公安机关报案并立即将车辆收回，因此产生的一切费用由承租方承担。
1.3 出租方提供符合车辆管理部门检验要求的车辆作为租赁车辆，交付车辆的具体条件由网站、APP、小程序等公示内容和实际交付车辆为准。
1.4车辆的全部租赁费用包括但不限于基本租车费、超期租金、强行续租违约金、车辆停运损失费、基础服务费、手续费、增值服务、用车期间产生的 ETC 费用、
贬值损失、加油服务费、超程服务费、夜间服务费、违章罚金、违约金等，费用标准以小程序、网站、APP、门店公示为准。
1.5承租方未按时结清本合同及附件项下费用的，出租方有权从双方签订的其他合同交纳的押金或刷取的预授权中直接扣除。承租方基于本合同及附件交纳的押金或刷取的预授权亦可用于支付承租方拖欠出租方的其他债务费用。
1.6承租方以信用卡、借记卡或芝麻信用方式来支付相关费用的，同意出租方或出租方授权的收款方通过第三方支付平台或开卡银行从其信用卡或借记卡中直接扣划，承租方通过以芝麻信用或其它第三方信用预售权来做担保的，同意出租方扣除相应合同项费用，由此产生的后果由承租方承担。
1.7承租方及其担保人同意并授权出租方凭《租车合同》或其他经担保人签字的单据， 直接从承租方及其担保人的各类授权账户中直接扣除相应费用。
1.8承租方必须先付款，再用车，在出租方提供车辆前支付所预定车辆的所有应付费用（包括但不限于租金、押金），否则出租方有权拒绝提供车辆。出租方已经提供车辆的，有权随时要求承租方返还车辆。若承租方既未付租金也未归还车辆，即判定为非法占用出租方车辆，为维护出租方权益，出租方将视情况自行或通过其他渠道收回车辆，承租方需承担未支付款项日起直至车辆收回的一切费用，包括但不限于双倍租金（按市场价格的双倍计算租金损失）
、强行占用违约金、车辆收车费（按出车门店到车辆实际所在地里程计算，每公里十元）、车辆设施设备损失赔偿金、以及其他因承租方使用而产生的费用。
二、承租方的权利和义务
2.1承租方于租期内享有承租车辆符合承租用途的使用权，承租方承诺其持有中国大陆交管部门核发的并按要求审验的《中华人民共和国机动车驾驶证》。同时，承租方承诺车辆租赁所使用并交出租方留存复印文件的《中华人民共和国机动车驾驶证》、身份证、信用卡和其它个人信息的真实性、合法性，并为其负全部负责。
2.2承租方自行承担车辆使用期间产生的燃油费用、停车费、ETC 和过路过桥等费用，自行负责车上人员及财产安全。承租人在使用承租车辆时应当严格遵守道路交通规则，全部承担因交通违法违规产生的相关责任。
2.3如承租车辆出现故障或异常，承租方应立即通知出租方，并到出租方指定地点修理。承租方不得擅自拆卸、更换原车设备及零件。
2.4承租方同意并授权出租方凭《租车合同》和其他经持卡人签字的单据，通过发卡机构进行直接扣款。
2.5承租方应如实告知相关信息（包括但不限于身份证件、联系方式等），并保证使用车辆期间《租车单》所载明的联系方式有效，承租方承诺《租车单》以及《租车合同》上载明的乙方证件号码、联系方式、通讯地址等信息真实有效，甲方通过电话、短信、即时通讯软件、电子邮件或邮寄等任何一种方式履行告知后，即视为乙方获悉。
双方就租车合同中涉及的各类通知、协议等文件以及就合同发生纠纷时相关文件和法律文书送达时的送达地址及法律后果作如下约定：
出租方确认其唯一有效的送达地址为：
重庆市渝北区民安大道 1 号追风（重庆）汽车租赁有限公司
承租方默认并确认其唯一有效的送达地址为身份证件标明的个人地址。若承租方对此地址异议，可在合同最后列明其它有效送达地址。
双方该送达地址适用范围包括双方各类通知、协议等文件以及就合同发生纠纷时相关文件和法律文书的送达，同时包括在争议进入仲裁、民事诉讼程序

后的一审、二审、再审和执行程序。
2.6本合同要求承租方租车下单所使用的信用卡预售权、第三方平台信用预售权所有人与承租人（驾驶证持有人）、《租车合同》及《验车单》签订者必须一致，
若上述人员不一致，则视信用卡预售权、第三方平台信用预售权所有人为承租方的担保人，担保人须向出租方提供本人身份证复印件，担保人确认担保范围为：承租方在承租车辆中所发生的车辆事故、车辆维修、违章、租金、ETC
费用、违约金及出租方为追索上述费用所花费的其他费用等承担无限连带担保责任。担保期间为自双方约定的还车日起两年。
三、车辆租赁相关规定
3.1双方关于租赁车辆、租期、费用、取还车日期等具体信息参见《租车单》、《验车单》等租赁手续。
3.2由于承租方遗失车辆证照或因违法违规用车被扣等情况造成车辆停运的，承担方应承担由此造成的车辆停运损失费。约定租期内租金正常结算；超过约定租期租赁车辆仍无法合法使用或未归还的，承租方应以《租车单》中的车辆租金均价为标准按日计算向出租方支付停运损失费，该费用计算至租赁车辆补齐证照可合法使用或归还时止。
3.3租赁期满，承租方应按规定的还车时间和地点交还车辆、证照及附带设备，并保持车辆清洁。由出租方工作人员依《验车单》内容验收，如有损坏或丢失应照价
3.4赔偿，价格标准以小程序、网站、APP、门店公示为准。
承租方将车辆交付出租方时，应在《验车单》中签字以确认归还车辆的时间、车辆状态等信息。如归还车辆时双方对归还车辆的状态有异议，应在《验车单》中将异议列明，由双方签字，并当场有针对性的拍照取证。一方拒绝签字或拒绝拍照的，拒绝一方应承担由此产生的不利后果。若因承租方原因无法现场交付车辆，如给出租方造成相应损失的，出租方保留向承租方主张相关权益的权利。
3.5承租方如需续租，须在租期届满前 24
小时向出租方电话申请，出租方有权决定是否同意续租，同意续租的，承租方须按照续租时间点小程序、网站、APP、门店公示的车辆租赁价格支付日租金及基础服务费等，并提供支付凭证给出租
方，本合同其他条款持续有效；出租方同意续租的，承租方需预先支付续租费用，出租方不同意续租的，承租方必须按原定合同约定时间和地点归还车辆。承租方未经出租方同意续租并未按期还车的，按3.5强行续租超期未归还处理。
3.6租赁期限届满承租方强行续租超期未归还承租车辆，应按照日租金的 200%为标
准，按日（不足1日的按1日计）支付超期期间违约金及出租方由此产生的其它损失，直至车辆归还日截止收取，并且出租方有权立即收回车辆；在租车城市以外地区收回车辆的，承租方须另行支付异地收车费（收费标准为每公里 10 元）。
3.7若因承租方疏忽或操作不当造成的车辆故障需要出租方救援的，承租方需按出租方公示价格支付相应救援费。
3.8承租方同意以《租车单》载明的计费标准、实际租车时间、接受服务情况、相关部门出具的违章处理等作为结算依据结算费用，承租方应于租赁期限届满时进行结算。结算时未发现租赁期间内产生的违章处理等费用的，结算后出租方仍有权要求承租方处理并承担相应费用。
3.9承租方提前还车且要求退款的，须向出租方缴清租赁期间所有费用(租金按照租赁期间不享有任何活动优惠的日租金标准结算)，且需另付原总租金 20%的违约金。
3.10承租方在承租期间所发生的违章，由承租方承担：1、线上订单符合免押条件未收取违章押金的，若承租方未能及时处理违章，出租方有权按照合同约定继续追责。2、出租方有权在承租方担保所使用的各类押金类型中扣除违章处理费用。3、如因承租方未能及时处理，给出租方车辆造成相应损失的，出租方有权向承租方追责。4、任何情形下，出租方与承租方结算租赁费用、退还承租方违章押金均不应被视为出租方认可承租方车辆租赁期间再无与该车辆相关的任何违章处罚或其它违约情形。
四、保险、事故及燃油
4.1所有租赁车辆均在保险公司投保，具体投保险种以生效保单为准，保险服务内容详见出租方网站和门店公示内容。
4.2承租车辆在租赁期间内发生的交通事故或其他事故造成的一切责任及损失，保险赔付范围外的由承租方承担，保险赔付范围内的损失依照本合同中 4.3
条的约定。除此，承租方还须按照停运天数按日租金另行支付因事故导致承租车辆停运的停运损失；维修费超过 8000 元的（含 8000 元），还须另行支付相当于实际产生的维修费总额 20%的车辆贬值损失。
4.3租车保障由基本保障服务费（必买）和驾无忧保障（选购）两项构成：租车时
购买了驾无忧保障的，保险赔付范围内的损失均由保险公司承担；仅支付基本保障服务费，事故损失为 1500 元内（含 1500 元）的，承租方自行承担，事故损
失超过 1500 元，承租人需承担 1500 元，超过部分由保险公司承担保险赔付范围内的损失。
4.4无论是否购买驾无忧保障服务，承租车辆发生的事故造成的车辆损失、第三方直接或间接损失，超出保险保额的部分，以及保险公司在保额范围内拒赔的部分，全部由承租方承担。
4.5承租期间，车辆如发生自身故障（非事故）或出现异常的，承租方应当立即停止

行驶，立即通知出租方，并到出租方指定地点修理，承租方不得擅自拆卸、更换原车设备及零件。
4.6承租车辆出险后，承担方应在出险现场报案并立即通知出租方（出租方确认唯一有效联系方式：400-6200-005）承租方应先行垫付费用（包括但不限于维修费、医疗费等）；因承租方未及时采取上述措施或操作不当而导致保险公司拒赔的及损失扩大等的责任由承租方自行承担。
4.7无论是否购买驾无忧保障，车辆发生报废的，承租方须支付相当于车辆实际价值20%的车辆价值折损损失费；若造成车辆报废保险公司拒绝理赔或未按照车辆实际价值理赔的，承租方需承担车辆实际价值的赔偿或补齐保险未赔偿的差额部分；车辆在承租方承租期间发生的自燃、自爆、水淹、火烧、灭失、被盗、被骗、被抢夺等情形的，承租方仍需赔偿车辆的实际价值，并承担直至车辆找回或者足额赔偿完毕车辆价值期间的车辆租金。并第一时间寻求公安机关立案处理。承租方不得以作为受害人免除对出租方所有权车辆自燃、自爆、水淹、火烧、灭失、被盗、被骗、被抢夺等情形的赔偿责任。
4.8如承租方因违法违规驾驶、不按车辆性能或操作程序使用，包括但不限于超速、酒后、驾驶证无效等情形，发生事故车辆损坏严重且对事故负主要责任时，承租方同意由出租方指定维修点维修，承租方除承担上述合同条款列明的赔偿责任外，无论是否购买驾无忧保障，承租方驾车出现上述情形的，都需要承担出租方全部损失以及车辆维修费用总额
30%的违约金。
4.9如因承租方提供材料不齐全等原因导致保险公司无法理赔、理赔不足或拒赔的， 承租方应当赔偿出租方所有损失。
4.10如承租方在车辆发生事故后，存在（包括但不限于）下列情形的，出租方有权以当日租金为标准，按日向承租方收取违约金，直至承租方配合出租方处理事故完毕并结清出租方损失：
（1）承租方未在事故发生第一时间向出租方履行告知程序的。
（2）因承租方自身原因而导致保险公司拒赔或操作不当导致损失扩大的。
（3）承租方在事故发生时自行弃车而逃的。
（4）事故处理中承租方拒绝配合出租方处理。
（5）如因承租方原因导致保险公司拒绝赔偿车辆损失，而承租方也拒绝赔偿出租方 损失的。
（6）承租方存在其它拒绝配合出租方的行为等。
（7）承租方在给承租车辆加油时，必须按出租方规定的燃油使用标号加油。如还车 燃油少于取车燃油的，承租方须按出租方规定支付相应费用。如因加油不当所造成的损失，由承租方承担。
（8）车辆租期内车辆零部件丢失、轮胎及轮毂的损坏、玻璃单独破损、反光镜碎。
（9）锁芯损坏等均不属于保险赔付范围，由承租方承担损失。五、合同解除
5.1承租方未按本合同约定履行义务的，包括支付相应费用或归还车辆等合同约定的其他义务，出租方有权单方解除合同，即不提供车辆、强制收回车辆。
5.2在合同到期时自动解除，，本合同默认有效日期截止为合同订单截止日期。若承租方提出续租、出租方同意续租但未预先支付费用，则视为承租方未续租成功。若承租方未按照约定内容及时还车，出租方有权以非法占有起诉承租方，并将视情况自行或通过其他渠道收回车辆，承租方需承担未支付款项日起直至车辆收回的一切费用，包括但不限于双倍租金（按市场价格的双倍计算租金损失）、强行占用违约金、车辆收车费（按出车门店到车辆实际所在地里程计算，每公里十元）、车辆设施设备损失赔偿金、以及其他因承租方使用而产生的费用。
5.3因承租方的原因导致本合同解除，本合同解除后，出租方仍有权按照本合同约定的违约责任追究承租方的违约责任。
六、违约责任
6.1任何一方未严格履行本合同及附件义务的，另一方有权要求对方承担违约责任并赔偿损失。
6.2承租方未依约使用车辆或未按时结清本合同项下费用，或承租车辆使用中出现动向异常、逾期不还、抵押、质押、变卖、预留联系方式不正确或无法有效联系等情形的，出租方有权立即收回承租车辆，由此产生的费用或相关损失由承租方承担。
6.3承租方未履行其付款义务的，每逾期 1 日，须支付未付款项的 5‰作为违约金。
6.4出租方有权通过 1.5 所述之方式向承租方收取承租方基于本合同之规定而产生的所有款项。
6.5承租方不得将承租车辆用于营利性运营、竞赛、测试、教练等活动；承租方不得有转租、转借、抵押、倒卖或其他任何损害车辆所有权和使用权的行为；承租车辆不得承载宠物、海鲜等异味物品，有毒有害及违禁物品，不得酒后开车，不得从事违法、违规活动，否则，承租方应承担一切损失及责任。
6.6本合同解除后，承租方未归还车辆，以日租金的200%为标准按日计算承租方的违约金直至车辆归还，且由承租方承担出租方收回车辆的差旅费、异地收车费；在租车城市以外地区收回车辆的，承租方须另行支付异地收车费（收费标准为每公里
10 元）。
6.7若本合同其他部分约定了承租方的违约责任，出租方有权以责任重的条款追究承租方违约责任。
七、其他
7.1未经出租方书面同意，承租方所租赁车辆不得进入西藏，泸沽湖，新疆，四川省甘孜，阿坝地带，不得驶出国（边）境，不得驶离国道、省道、县道、乡道，不得穿越沙漠、沼泽和戈壁，若承租方出现上述行为均视为违约，出租方有权按照车辆当日租金的
300%为标准，按日向承租方要求支付违约金及其它损失，包括但不限于车辆救援费用、车辆维修费、停运损失费等，且出租方有权及其它赔偿责任。
7.2出租方不会以个人名义向承租方收取任何费用，所有租车费、油费、保险费、事故赔 偿、违章等费用均会通过出租方公司账户收取，请承租方切勿向任何个人账户支付费用，否则出租方有权对此费用予以否认。
7.3本合同所指保险赔付范围是依照保险公司条款及相关法律规定而最终确定的保险公司实际理赔范围。
7.4本合同所指持卡人为使用本人信用卡或借记卡在出租方作刷卡消费或预授权的人。
7.5承租方于签署本合同前已知晓出租方自有或合作品牌小程序、APP、网站、门店等公示的最新政策，并同意将该等政策作为本合同附件遵守; 如《随车手册》约定事项与最新公示政策或合同相冲突的，以公示或合同为准。
7.6租赁车辆发生交通事故，造成他人损失的，由承租方承担全部赔偿责任，若法院判决出租方承担的，则在出租方承担后，有权向承租方追责。
7.7承租方同意出租方可将全部租车文件项下的权利义务（包括诉讼管辖之约定）在第三方承诺全部接受出租方的权利义务前提下，全部或部分转让给第三方。
7.8有关本合同的一切争议，双方应协商解决；协商不成的，任何一方均可向出租方所在地的法院起诉。出租方为处理可归责于承租方事由导致的非诉讼、诉讼纠纷而发生的合理费用，包括但不限于诉讼费、保全费、评估费、律师费、调查取证费用、差旅费等全部由承租方承担。
7.9本合同未尽事宜，双方可另行协商签订补充协议，与本合同具有同等的法律效力。
7.10本合同自各方签字或盖章后生效。
承租方确认在签署本合同前，已经知悉合同全部内容，并完全理解协议各条款的法律含义，同意按照本合同约定履行相应义务。
承租方：本人已阅读、理解本合同所有条款内容，并同意按照本
合同约定如实履行相应义务。</scroll-view>
		<view v-if="!img" class="sign">
			<text class="sign-box" @click="$open('/pages/common/signIng')">点击签名</text>
		</view>
		<view v-else class="sign">
			<view>签名:</view>
			<image class="sign-pic" :src="img" @click="goSign" mode="aspectFill"></image>
		</view>
		<view v-if="!img && mode==='edit'" class="btn-before">提交</view>
		<view v-if="img && mode==='edit'" class="btn-after" @click="vehicleUpdateVehicleCertificates">提交</view>
	</view>
</template>

<script>
	import {
		vehicleGetVehicleCertificatess,
		vehicleUpdateVehicleCertificates
	} from '@/apis/vehicle'
	import {
		throttle
	} from '@/utils/tools'
	import {
		previewImgs
	} from '@/utils/uni-tools'
	import {
		mapState
	} from 'vuex'

	export default {
		data() {
			return {
				mode: '', // 模式 edit:编辑模式 readonly:只读模式
				from: '', // order  orderDetail
				img: '', // 合同
				id: '', // 合同id
				orderId: '', // 订单id
				vehicleId: '' // 车辆id
			}
		},
		computed: {
			// app 页面高度
			...mapState('app', ['windowHeight'])
		},
		onLoad(e) {
			if (e && e.orderId) this.orderId = e.orderId
			if (e && e.vehicleId) this.vehicleId = e.vehicleId
			if (e && e.mode) this.mode = e.mode
			if (e && e.from) this.from = e.from
			this.vehicleGetVehicleCertificatess()
			this.eventListenter()
		},
		methods: {
			// 查看合同
			async vehicleGetVehicleCertificatess() {
				const params = {
					orderId: this.orderId,
					vehicleId: this.vehicleId
				}
				const [err, res] = await vehicleGetVehicleCertificatess(params)
				if (err) return
				if (res.code === 500) {
					setTimeout(() => {
						this.$close()
					}, 500)
					return
				}
				if (res.data.contract) this.img = res.data.contract
				this.id = res.data.id
			},
			// 去签名
			goSign() {
				if (this.mode === 'edit') {
					this.$open('/pages/common/signIng')
				} else if (this.mode === 'readonly') {
					// this.previewPics([this.img])
				}
			},
			// 预览图片
			previewPics(urls, index = 0) {
				previewImgs(urls, index)
			},
			// 上传合同
			vehicleUpdateVehicleCertificates: throttle(async function() {
				const params = {
					id: this.id,
					orderId: this.orderId,
					vehicleId: this.vehicleId,
					contract: this.img
				}
				const [err, res] = await vehicleUpdateVehicleCertificates(params)
				if (err) return
				this.$toast('提交成功')
				setTimeout(() => {
					this.$open('/pages/order/useCarSuccess', {
						from: this.from
					})
				}, 500)
			}),
			// 监听函数
			eventListenter() {
				// 监听合同
				uni.$on('refreshSign', e => {
					this.img = e.sign
				})
			}
		}
	}
</script>

<style lang="scss">
	@import '@/static/scss/_mixin.scss';

	.title {
		width: 90%;
		font-size: 35rpx;
		color: #000000;
		padding-top: 20rpx;
		padding-left: 20rpx;
	}

	.content {
		@include box-w();
		padding: 30rpx;
		@include font-set(28rpx, #666);
		@include text-reserve;
		line-height: 60rpx;
	}

	.sign {
		width: 90%;
		margin: 0 auto;
		display: flex;
		align-items: center;
		justify-content: flex-end;
	}

	.sign-box {
		color: #5A7EFF;
		border-bottom: 2rpx solid #5A7EFF;
		margin-top: 20rpx;
	}

	.sign-pic {
		display: block;
		width: 188rpx;
		height: 256rpx;
		transform: rotate(270deg);
		margin-left: 60rpx;
	}

	.btn-after {
		position: fixed;
		bottom: 60rpx;
		left: 50%;
		transform: translateX(-50%);
		color: white;
		width: 88%;
		background-color: #5A7EFF;
		border-radius: 50px;
		font-size: 32rpx;
		height: 96rpx;
		line-height: 96rpx;
		text-align: center;
	}

	.btn-before {
		position: fixed;
		bottom: 60rpx;
		left: 50%;
		transform: translateX(-50%);
		border: 0 !important;
		width: 670rpx !important;
		background-color: #ddd;
		border-radius: 50px;
		font-size: 32rpx;
		height: 96rpx;
		line-height: 96rpx;
		color: #fff !important;
		text-align: center;
	}
</style>
