<template>
	<view class="security">一、驾无忧保障（选购）两项构成：租车时购买了驾无忧保障的，保险赔付范围内的损失均由保险公司承担；仅支付基本保障服务费，事故损失为1500元内（含1500元）的，承租方自行承担，事故损失为1500元内（含1500元）的，承租方自行承担，事故损失超过1500元，承租人需承担1500元，超过部分由保险公司承担保险赔付范围内的损失。
二、无论是否购买驾无忧保障服务，承租车辆发生的事故造成的车辆损失、第三方直接或间接损失，超出保险保额的部分，以及保险公司在保额范围内拒赔的部分，全部由承租方承担。
三、无论是否购买驾无忧保障，车辆发生报废的，承租方须支付相当于车辆实际价值20%的车辆损失费；车辆发生盗抢的，承租方须支付相当于车辆实际价值20%的车辆损失费。并且在该期间内车辆租金连续计算收取至车辆管理部门出具报废证明之日或公安机关立案之日止。
四、如因承租方提供材料不齐全等原因导致保险公司无法理赔、理赔不足或拒赔的，承租方应当赔偿出租方所有损失。
五、如承租方在车辆发生事故后，存在（包括但不限于）下列情形的，出租房有权以当日租金为标准，按日向承租方收取违约金，直至承租方配合出租方处理事故完毕并结清出租方损失：
（1）承租方未在事故发生第一时间向出租方履行告知程序的。
（2）因承租方自身原因而导致保险公司拒赔或操作不当导致损失扩大的。
（3）承租方在事故发生时自行弃车而逃的。
（4）事故处理中承租方拒绝配合出租方处理。
（5）如因承租方原因导致保险公司拒绝赔偿车辆损失，而承租方也拒绝赔偿出租方损失的。
（6）承租方存在其它拒绝配合出租方的行为等。
（7）承租方在给承租车辆加油时，必须按出租方规定的燃油使用标号加油。如还车燃油少于取车燃油的，承租方须按出租方规定支付相应费用。如因加油不当所造成的损失，由承租方承担。
（8）车辆租期内车辆零部件丢失、轮胎及轮毂的损坏、玻璃单独破损、反光镜碎。
（9）锁芯损坏等均不属于保险赔付范围，由承租方承担损失。
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {

		}
	}
</script>

<style lang="scss">
	@import '@/static/scss/_mixin.scss';

	.security {
		padding: 30rpx;
		@include font-set(28rpx, #666);
		@include text-reserve;
		line-height: 60rpx;
	}
</style>