<template>
	<view class="user-agreement">
		<view class="title">追风租车会员注册协议</view>
		<view class="sub-title">注册协议</view>
		为了维护您的利益，请您认真阅读本协议以下各条款（特别是黑体加粗部分），充分了解您的权利及义务。您阅读并同意本协议后，即表示您已对所有条款的含义及相应的法律后果全部通晓并充分理解，且自愿作出下述授权、承诺和声明。其中，授权包含《征信业管理条例》中征信业务，您应对于《征信业管理条例》及相关法律法规有一定的了解，如您不能清楚地知晓或理解国家相关法律法规规定的内容，您应咨询相关法律专业人士后再决定是否接受本协议。
		<br>
		1．特别提示<br>
		1.1 追风（重庆）汽车租赁有限公司（以下简称“追风租车”）同意按照本协议的规定及其不时发布的操作规则提供基于互联网的相关服务（以下称“网络服务”）；为获得网络服务，服务使用人（以下称“用户”）应当同意本协议的全部条款并按照页面上的提示完成包括实名认证等在内的全部注册程序。用户注册成功即表示用户完全接受本协议项下的全部条款。
		<br>
		1.2 用户注册成功后，追风租车将给予每个用户一个帐号并由用户自行设置相应密码，该用户帐号及其密码由用户自行保管，任何该账户项下的预订及支付等行为均视为该用户本人的操作。
		<br>
		1.3 为提供更好的服务，追风租车有权使用通过合法途径获得的用户其他身份信息（如身份证照片等）、银杏分、芝麻信用分等用于为用户提供服务。
		<br>
		
		2. 服务内容
		<br>
		通过追风租车小程序、网站或者客户端在线预订车辆、查询价格车型信息、对提供的服务发表意见等。
		<br>
		3. 服务变更、中断或终止
		<br>
		3.1 鉴于网络服务的特殊性，用户授权追风租车可随时变更、中断或终止部分或全部的网络服务。由于追风租车需要定期或不定期地对提供网络服务的平台（如互联网网站）或相关的设备进行检修或者维护，如因此类情况而造成网络服务在合理时间内的中断，追风租车无需为此承担任何责任。
		<br>
		3.2 如发生下列任何一种情形，追风租车有权在通知用户后中断或终止向用户提供本协议项下的网络服务而无需对用户或任何第三方承担任何责任：
		<br>
		3.2.1 用户提供的个人资料不真实；
		<br>
		3.2.2 用户违反本协议中规定的使用规则；
		<br>
		3.3 如用户注册的帐号在任何连续180日内未实际使用，则追风租车有权删除该帐号并停止为该用户提供相关的网络服务。
		<br>
		
		4. 使用规则
		<br>
		4.1 用户在申请使用追风租车网络服务时，必须向追风租车提供真实准确的个人资料，如个人资料有任何变动，必须在三个工作日内更新。
		<br>
		4.2 用户需妥善保管其个人账号密码，无论基于何种相关目的，都不允许将帐号、密码转让或出借于他人使用。如用户发现其帐号遭他人非法使用，应当立即通知追风租车。因黑客行为、用户的保管疏忽导致帐号、密码遭他人非法使用或用户将其帐号、密码转让或出借于他人使用而导致任何的客户损失，追风租车不承担任何责任。
		<br>
		4.3 用户注册成功后，视为允许追风租车通过电子邮件或其他方式向用户发送追风租车的优惠服务信息。
		<br>
		4.4 用户在使用追风租车网络服务过程中，必须遵循以下原则：
		<br>
		4.4.1 遵守中国有关的法律和法规；
		<br>
		4.4.2 遵守所有与网络服务有关的网络协议、规定和程序；
		<br>
		4.4.3 不得为任何非法目的而使用网络服务系统；
		<br>
		4.4.4 不得利用追风租车网络服务系统进行任何不利于追风租车的行为。
		<br>
		
		5. 知识产权
		<br>
		追风租车提供的服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。追风租车为提供服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。
		<br>
		6. 隐私保护
		<br>
		6.1 保护用户隐私是追风租车的一项基本政策，追风租车保证不对外公开或向第三方提供单独用户的注册资料及用户在使用网络服务时存储在追风租车的非公开内容，但下列情况除外：
		<br>
		6.1.1 事先获得用户的明确授权；
		<br>
		6.1.2 根据有关的法律法规要求；
		<br>
		6.1.3 按照相关政府主管部门的要求；
		<br>
		6.1.4 为维护社会公众的利益；
		<br>
		6.1.5 为维护追风租车的合法权益。
		<br>
		6.2 当追风租车与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方允诺严格承担与追风租车同等的保护用户隐私的责任，则视为客户授权追风租车将包含其个人注册资料在内的相关信息仅提供给该等第三方。
		<br>
		7. 免责条款
		<br>
		7.1 有下列情况之一的，追风租车不承担任何法律责任：
		<br>
		7.1.1 由于您将用户密码告知他人或与他人共享注册帐户，而导致的任何个人资料泄露；
		<br>
		7.1.2 任何由于计算机2000年问题、黑客攻击、计算机病毒侵入或发作、政府管制等造成的暂时性关闭，使网络无法正常运行而造成的个人资料泄露、丢失、被盗用或被窜改；
		<br>
		7.1.3 由于与本网站链接的其他网站所造成的个人资料泄露及由此而导致的任何法律争议和后果；
		<br>
		7.1.4 因不可抗力而引起的任何后果。
		<br>
		7.2. 根据《中华人民共和国宪法》和相关法律法规规定，在保护公民合法言论自由的同时，禁止利用互联网、通讯工具、媒体以及其他方式从事以下行为：
		<br>
		7.2.1 组织、煽动抗拒、破坏宪法和法律、法规实施的。
		<br>
		7.2.2 捏造或者歪曲事实，散布谣言，妨害社会管理秩序的。
		<br>
		7.2.3 组织、煽动非法集会、游行、示威、扰乱公共场所秩序的。
		<br>
		7.2.4 从事其他侵犯国家、社会、集体利益和公民合法权益的。管理部门将依法严加监管上述行为并予以处理；对构成犯罪的，司法机关将追究刑事责任。
		<br>
		7.3 您同意作出以下授权，追风租车在您授权内不承担任何责任
		<br>
		  您同意并授权追风租车向您提供服务前，可以通过第三方机构查询并获取您的信用信息、个人信用报告等。且同意并授权第三方机构向追风租车提供您的信用信息、个人信用报告等。
		您同意并授权追风租车可以通过第三方机构对用户的本次征信服务中向已保存用户个人信息的机构或个人（包括但不限于公共事业单位、网络服务机构、电信运营商等）采集用户的个人信息。同时用户同意信息提供者在本次征信服务过程中向征信机构提供用户个人信息。
		您同意并授权追风租车可以通过第三方机构对用户的银杏分、芝麻信用分等内容进行查询。
		<br>
		8. 违约赔偿
		<br>
		8.1 如因追风租车违反有关法律、法规或本协议项下的任何条款而给用户造成损失，追风租车同意承担由此造成的损害赔偿责任。
		<br>
		8.2 用户同意保障和维护追风租车及其他用户的合法利益，如因用户违反有关法律、法规或本协议项下的任何条款而给追风租车或任何其他第三人造成损失，用户同意承担由此造成的一切损害赔偿责任。
		<br>
		
		9. 协议修改
		<br>
		9.1 追风租车有权随时修改本协议的任何条款，一旦本协议的内容发生变动，追风租车将会在公众号（追风租车）公布修改之后的协议内容，该公布行为视为追风租车已经通知用户修改内容。
		<br>
		9.2 如果不同意追风租车对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受追风租车对本协议相关条款所做的修改。
		<br>
		
		10.通知送达
		<br>
		10.1本协议项下追风租车对于用户所有的通知均可通过公众号公告、电子邮件、手机短信或常规的信件传送等方式进行；追风租车可任意选择其中一种方式通知用户，该通知于发送之日视为已送达用户，用户知悉并接受通知之内容。
		<br>
		10.2用户如有任何事宜需通知追风租车，应当通过追风租车对外正式公布的通信地址、传真号码、电子邮件地址、电话号码等联系方式进行联系及送达。
		<br>
		
		11. 法律管辖
		<br>
		如双方就本协议内容或其执行发生任何争议，双方应友好协商解决；协商不成时，任何一方均可向追风（重庆）汽车租赁有限公司所在地的人民法院提起诉讼。
		<br>
		
		隐私保护声明
		<br>
		  追风租车（以下简称“我们”）深知用户（以下简称“您”）个人隐私的重要性并尊重您的隐私权利。我们将按照法律法规的要求，采取相应措施来保护您的个人信息。我们希望通过本隐私声明向您介绍您在使用我们的产品/服务时，我们是如何收集、使用、保存、删除您的个人信息。
		       在您使用追风租车各项产品或服务前，请您务必仔细阅读并透彻理解本声明，特别是以粗体/粗体下划线标识的条款，您应重点阅读，在确认充分理解并同意后再开始使用。如果您不同意本隐私声明的任何内容，您应该立即停止使用我们的产品或服务。
			   <br>
		    追风租车的用户隐私保护声明目录如下：
			<br>
		    一、 个人信息的定义与范围
			<br>
		    二、 我们如何收集和使用您的个人信息
			<br>
		    三、 设备权限调用
			<br>
		    四、 我们使用Cookie技术的原因
			<br>
		    五、 个人信息的保存
			<br>
		    六、 我们如何共享、转让、公开披露您的信息
			<br>
		    七、 如何保护您的个人信息
			<br>
		    八、 我们如何处理未成年人的信息
			<br>
		    九、 变更
			<br>
		    十、 如何联系我们
			<br>
		    十一、免责条款
			<br>
		
		       一、 个人信息的定义与范围
			   <br>
		       个人信息指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。在本隐私保护声明中包括：姓名、手机号码、身份信息、照片、性别、年龄、职业信息、征信信息、驾驶证、地址、紧急联系人、位置信息、支付信息、银行卡号、银杏分等。
			   <br>
		    
		      二、我们如何收集和使用您的个人信息
			  <br>
		      我们会遵循正当、合法、必要的原则，出于本政策所述的以下目的，收集和使用您在使用服务过程中主动提供或产生的个人信息，以便帮助您成为我们的用户，及我们向您提供产品\服务，同时为您优化用户体验、提供安全保障:
			  <br>
		   （一）帮助您成为我们的用户
		   <br>
		     为遵守法律法规的要求，以及向您提供更个性化、更便捷的服务，在您注册成为追风租车用户时，您需要至少提供手机号码以创建追风租车账号，并完善相关的网络身份识别信息（如头像、昵称及登录密码等）；如果您仅需使用浏览、搜索等功能，您无需注册成为我们的用户以及提供上述信息。
		      在提供账号信息的过程中，如果您愿意额外补充如下个人信息，将有助于我们向您提供更为个性化的服务：包括您的性别、生日、常居地、家乡、喜好、家庭信息等。如果您不提供该等信息，不会影响您享受追风租车服务的基本功能。
			  <br>
		   （二）向您提供产品\服务
		   <br>
		     1. 您向我们提供的个人信息
			 <br>
		预订\下单：您在追风租车上预订\下单等服务时，您可能需要提供联系人信息（姓名、性别、电话号码等）、地址信息（如使用家政服务时）、服务偏好（如租车人数等）等；
		您在追风租车上预订\下单等业务时，您可能需要根据有关法律规定和相关方要求提供您的实名身份信息（包括但不限于您的身份证、护照、驾驶证等载明您身份的证件照片、复印件、号码、银杏分等）、联系人信息（姓名、性别、电话号码等）、电子邮箱地址（用于确认订单信息等）、个人照片（用于初诊等）、同行人信息、紧急联络人信息等。
		<br>
		配送\邮寄：当您在追风租车上使用邮寄（例如发票邮寄）服务时，您需要提供取\收货人的姓名、性别（用于配送人员联络时称呼您，如张女士）、手机号码、收货地址、门牌号等，以便于您的订单能够安全准确送达并完成。您还可以选择为常用地址加注标签（如家、公司等），以便于此后的查找使用。
		<br>
		信息发布：您在追风租车上主动对服务进行评价或发布其他内容时，我们将收集您发布的信息，并展示您的昵称、头像和发布内容等。如您选择以匿名方式发布评价信息时，我们将不展示您的昵称、头像。您还可以通过主动上传图片、视频等方式授权追风租车访问您的相机、照片和麦克风，以便于您通过拍照、拍视频、上传照片或上传视频等方式发布内容。当您需要关闭该功能时，大多数移动设备都会支持您的这项需求，具体方法请参考或联系您移动设备的服务商或生产商。
		<br>
		支付：您在追风租车上支付时，您可以选择追风租车或者与追风租车合作的第三方支付机构（如微信支付、支付宝等支付通道）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的追风租车订单信息及对账信息与这些支付机构共享以确认您的支付指令并完成支付。
		<br>
		客服：当您与我们的客服取得联系时，我们的系统可能会记录您与客服之间的通讯记录，以及使用您的账号信息以便核验身份；当您需要我们提供与您订单相关的客户服务时，我们可能会查询您的相关订单信息以便给予您适当的帮助和处理；当您需要客服协助您修改有关信息（如配送地址、联系方式等）时，您可能还需要提供上述信息外的其他信息以便完成修改。
		为展示您账户的订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。
		您在追风租车上生成的订单中，将包含您的身份信息、联络信息、行程信息、住宿信息、支付信息等，这些都属于敏感信息，请您谨慎向他人展示或对外提供，我们也将会在展示订单信息时，在保证信息可用性的基础上尽量做去标识化处理。
		<br>
		2. 我们在您使用服务过程中可能收集的个人信息
		<br>
		为了满足法律法规及提供服务的基本要求，保障您的账号安全与系统运行安全，我们会收集您在使用我们服务过程中产生的相关信息，包括：
		<br>
		      （一）日志信息。当您使用我们提供的产品\服务时，我们会自动收集您使用我们服务的详细情况，并作为有关的网络日志保存，包括但不限于您的IP地址、浏览器的类型、使用的语言、操作系统的版本、访问的日期和时间、及您请求的网页记录等信息。
			  <br>
		      （二）位置信息。为了便捷您发现周边的餐饮、酒店、景点、商场、银行等生活服务信息，我们会基于您的地理位置为您提供服务（LBS）。当您开启设备定位功能并使用我们的LBS时，我们可能会收集和使用您的位置信息，以实现我们为您提供本地周边生活服务的目的（如您不需要手动输入自身地理位置就可获得相关服务，以及估算商家与您之间的实际距离方便您进行消费决策等）。我们会使用有关技术对您的实际位置进行定位，这些技术包括IP 地址、GPS 以及能够提供相关信息的Wi-Fi 接入点、蓝牙和基站等传感器技术。
		请您注意，大多数移动设备都允许您关闭定位服务，具体方法建议您参考或联系您移动设备的服务商或生产商，一旦您通过系统授权关闭定位功能，停止我们对您位置信息的收集，您将可能无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。
		<br>
		3. 我们可能间接收集到的您的个人信息
		<br>
		为能向您提供更优质的服务，同时为能确认交易状态及为您提供售后与争议解决服务，经您授权后我们会通过您选择的交易对象和交易直接涉及的第三方信息系统、支付机构等收集与交易进度相关的您的交易、支付、预订等信息，以便于我们处理您的订单并保证服务的顺利完成，或者更好地预防诈骗、刷单等恶意行为。我们会依据法律法规的要求以及与第三方的约定，经您授权后向追风租车的关联方、合作伙伴等获得您的有关信息，并对其信息来源的合法性进行确认后使用您的这些信息。
		<br>
		     （三）改进我们的产品\服务
			 <br>
		为维护、改进我们的产品或服务质量，向您提供个性化的服务，我们可能会在符合法律规定并根据您授权的情况下收集并使用如下信息：
		<br>
		1. 我们可能会收集您的订单信息、浏览及搜索信息、行为偏好（如您向我们提供的旅行计划、常用乘客/酒店/租车信息，航班舱位、行李和票务选择等信息）、位置信息等，以及将您在追风租车上使用某项服务中提供的信息与来自其他服务中的信息结合起来，进行综合统计、分析以形成用户画像，用来向您推荐或展示您可能感兴趣的产品\服务信息，或者通过系统向您展示个性化的第三方推广信息。包括在小程序或App页面向您推送消息通知，为您提供智能推荐，给您发送推广短信等。
		如您不希望收到小程序或App页面上的消息通知，可以在首次使用时拒绝接收消息通知，或者在关掉对应的通知功能；如您不希望接受我们的智能推荐服务，可以自主选择按照距离、好评、价格等方式进行排序；如您不希望接收我们给您发送的推广短信，可通过信息中相应的退订功能进行退订。当您选择退出定向推送后，可以按照本隐私政策中第五部分有关删除您的个人信息的路径删除您的相关个人信息。
		<br>
		2. 我们可能会收集您在参与产品\服务调查时主动向我们提供的信息，以及您与我们的关联方、合作伙伴之间互动时提供的相关信息，以便于您追踪订单情况、发起用户投诉以及我们优化客户服务的质量与流程。
		<br>
		3. 我们可能将业务中收集的个人信息用于统计分析和改进运营，例如通过您所在的位置、偏好等进行统计分析，从而改进我们的产品、服务或营销计划；又如为改进我们系统而进行的技术改造、网络维护、故障排除、内部政策与流程制定、生成内部报告等。
		<br>
		4.您可以授权（通过本隐私政策及独立的《信息授权使用协议》等）使用我们的服务创建交流与分享功能，并允许追风租车获取您手机或其他第三方社交平台中的通讯录信息和公开信息（头像、昵称等），从而使您及您通讯录中同样授权开通此项功能的联系人，能够在追风租车分享有关内容（头像、昵称、评价信息等）以实现互动功能。您还可以通过我们的服务邀请尚未开通分享功能的联系人开通该功能。此项功能您可以在好友设置中关闭，一旦关闭您将可能无法实现与您的好友在追风租车进行分享交流，但不会影响您享受追风租车服务的基本功能。
		<br>
		      （四）为您提供安全保障
			  <br>
		为提高您使用我们提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会使用或整合您的个人信息以及我们的关联方、合作伙伴取得您授权或者依法共享的信息，根据您的使用习惯和常用软件信息等来综合判断您的账号及交易风险，包括验证身份，预防、发现、调查可能存在的欺诈、网络病毒、网络攻击等安全风险以及违反我们或关联方协议、政策或规则等行为，以保护您、其他用户、我们或关联方的合法权益，并记录一些我们认为有风险的链接(“URL”)。
		<br>
		     （五）其他用途
			 <br>
		我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会单独征求您的授权同意。
		<br>
		     （六）请您知悉，以下情形中，我们收集、使用个人信息无需征得您的授权同意：
			 <br>
		1、与国家安全、国防安全有关的；
		<br>
		2、与公共安全、公共卫生、重大公共利益有关的；
		<br>
		3、与犯罪侦查、起诉、审判和判决执行等有关的；
		<br>
		4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
		<br>
		5、所收集的个人信息是个人信息主体自行向社会公众公开的；
		<br>
		6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
		<br>
		7、根据您的要求签订合同所必需的；
		<br>
		8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；
		<br>
		9、为合法的新闻报道所必需的；
		<br>
		10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
		<br>
		11、法律法规规定的其他情形。
		<br>
		请注意，无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将无法与任何特定个人建立联系的数据与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类信息将被视为个人信息。
		<br>
		 
		三、 设备权限调用
		<br>
		追风租车可能会调用您的一些设备权限，您可以在设备的设置功能中选择关闭部分或全部权限，从而拒绝追风租车调取相应的个人信息。使用系统不同的设备，权限显示方式和关闭方式可能有所不同，具体请联系设备及系统开发方。但关闭部分功能，可能会影响到您使用账号创建、租车、交易支付服务等核心业务功能。
		 <br>
		        四、我们使用Cookie技术的原因
				<br>
		        追风租车有时会使用cookies，使您在访问我们的网站时得到更好的服务。Cookies是指一种技术，当使用者访问设有Cookies装置的本网站时，本网站的服务器会自动发送Cookies至您的浏览器内，并储存到您的电脑硬盘内，此Cookies便负责记录日后您访问本网站的各种活动、个人资料、浏览习惯、消费习惯甚至信用记录。运用Cookies技术，本网站能够为您提供更加周到的个性化服务。追风租车使用Cookie来帮助您实现您的联机体验的个性化。因此，Cookie的主要用途之一是提供一种节约时间的实用功能。您可以接受或拒绝Cookie。大多数Web浏览器会自动接受Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝Cookie。
		 <br>
		        五、个人信息的保存
				<br>
		       1、在您使用追风租车的服务期间，我们会持续保存您的个人信息。
			   <br>
		       2、除下述情形外，您可以自主删除个人信息或注销账户：
			   <br>
		      a)为配合人民检察院、公安机关、国家安全机关侦查用户使用追风租车服务过程中产生涉嫌违法或犯   罪的行为，更好保护其他用户生命财产安全，为配合人民法院查清案情，您的个人信息和账户将被保存；
			  <br>
		      b)为遵守法律法规、政策等关于个人信息的保存期限的规定。
			  <br>
		      c)使用平台服务过程中，存在严重违反法律法规、平台协议、平台规则等情形，违法违约记录及相应平台信用记录将被永久封存。
			  <br>
		      3、我们收集的有关您的信息和资料将保存在我们和/或我们的关联公司的服务器上。根据相关法律法规的规定，用于识别您个人身份以及反映相关活动的个人信息及因您使用账户产生的相关文件资料，将在中国内地存储和使用，保存期限自您注销账户之日起算，不少于5年。如平台与用户另行签署的具体隐私协议就某类信息的保存期限做特殊约定的，从其约定。
			  <br>
		      4、如您希望删除个人信息，可以通过线上自行删除（如可以）或电话联系追风租车客服，提交删除申请。在满足本协议要求及法律法规要求的最短保存期限的情况下，我们将对您的个人信息进行删除或匿名化处理。不能删除或匿名化处理的，我们在您申请删除之后将不再对您的个人信息进行商业化使用。
			  <br>
		      5、如追风租车停止运营，我们将至少提前30日发布公告，并及时停止收集个人信息。停止运营后，我们将停止对个人信息的商业化使用，并在满足法律法规规定的最短保存期后，对收集的个人信息进行匿名化处理。
			  <br>
		      6、当追风租车存在以下情形时，您删除个人信息的申请将不受法律法规要求的最短保存期限限制：
			  <br>
		      a)追风租车违反法律、行政法规的规定收集、使用您的个人信息。
			  <br>
		      b)追风租车违反我们双方的约定收集、使用您的个人信息。
			  <br>
		     六、我们如何共享、转让、公开披露您的信息
			 <br>
		  （一）共享
		  <br>
		     我们不会与追风租车服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：
			 <br>
		    1、在法定情形下的共享：我们可能会根据法律法规规定、诉讼、争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。
			<br>
		    2、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
			<br>
		    3、在您主动选择情况下共享。
			<br>
		    4、与关联公司间共享：为便于我们基于追风租车向您提供产品和服务，推荐您可能感兴趣的信息，识别会员账号异常，保护追风租车关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司和/或其指定的服务提供商共享。我们只会共享必要的个人信息，且受本隐私保护声明所述目的的约束，如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。
			<br>
		    5、与授权合作伙伴共享：我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会出于本隐私保护声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且不得将此信息用于其他任何目的。
			<br>
		 （二）转让
		 <br>
		    我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
			<br>
		    1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
			<br>
		    2、在追风租车服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本声明的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。
			<br>
		 （三）公开披露
		 <br>
		    我们仅会在以下情况下，公开披露您的个人信息：
			<br>
		    1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；
			<br>
		    2、如果公安、检察院、法院等相关机关指出您出现违反法律法规或严重违反追风租车相关协议及规则的情况，或为保护追风租车用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及追风租车已对您采取的措施。
			<br>
		 （四）共享、转让、公开披露个人信息时事先征得授权同意的例外
		 <br>
		    以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
			<br>
		    1、与国家安全、国防安全有关的；
			<br>
		    2、与公共安全、公共卫生、重大公共利益有关的；
			<br>
		    3、与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；
			<br>
		    4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
			<br>
		    5、您自行向社会公众公开的个人信息；
			<br>
		    6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
			<br>
		    请知悉，根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。
			<br>
		      七、如何保护您的个人信息
			  <br>
		1、数据安全措施
		<br>
		       为保障您的信息安全，我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息，建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。
		      我们通过信息接触者保密协议，纵深防护体系以及身份认证、监控、审计等各类安全机制来对数据进行全面安全控制。防止您的个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如数据传输过程中使用加密传输协议；使用加密技术确保数据的保密性；使用受信赖的保护机制防止数据遭到恶意攻击；部署访问控制机制，确保只有授权人员才可访问个人信息；以及举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识；建立数据安全监控和审计制度，进行全面数据安全控制。
		      请注意，单独的设备信息、搜索关键词信息等无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将这类非个人信息与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类设备信息将被视为个人信息。我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本声明所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
		      互联网并非绝对安全的环境，我们强烈建议您通过安全方式、使用复杂密码，协助我们保证您的账号安全。如您发现自己的个人信息泄密，尤其是您的账户或密码发生泄漏，请您立即根据本声明中提供的联系方式联络我们，以便我们采取相应措施。
			  <br>
		2、安全事件
		<br>
		      在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的措施、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
			  <br>
		      八、我们如何处理未成年人的信息
			  <br>
		      我们极其重视对未成年人个人信息的保护。追风租车的服务仅面向成年人。如果您是未满18周岁的未成年人，您应立即停止使用我们的服务。
		     我们根据法律的规定保护未成年人的个人信息。
			 <br>
		       九、变更
			   <br>
		      随着网络平台信息服务的进一步提升，我们的隐私保护制度也将随之更新。我们会通过小程序、公众号发出更新版本、发送推送通知或以其他方式提醒您相关内容的更新，也请定期查看本页以了解我们对于隐私保护的最新措施。如无特别说明，修订后的隐私保护声明自公布之日起生效。在前述情况下，若您继续使用我们的服务，即表示同意接受修改后的本隐私保护声明并受之约束。
			  <br>
		      十、如何联系我们
			  <br>
		       任何时候如果您认为追风租车没有遵守这些原则时，请通知我们，我们会尽一切努力，在合理适当的范围内立即改善这个问题。
		       如果您的电话或电子邮箱发生变化，您可以按官方公众号公布的联系方式通知追风租车，以帮助我们保持您的资料的准确性。您也可以通过登录小程序等方式自行更新您的个人信息。追风租车欢迎您对我们的隐私保护制度给予评论并提出质疑。我们将致力于保护您的个人信息，尽全力保证这些信息的安全。
			   <br>
		         十一、免责条款
				 <br>
		  有下列情况之一的，追风租车不承担任何法律责任：
		  <br>
		（1）由于您将用户密码告知他人或与他人共享注册帐户，而导致的任何个人资料泄露；
		<br>
		（2）任何由于计算机2000年问题、黑客攻击、计算机病毒侵入或发作、政府管制等造成的暂时性关闭，使网络无法正常运行而造成的个人资料泄露、丢失、被盗用或被窜改；
		<br>
		（3）由于与本网站链接的其他网站所造成的个人资料泄露及由此而导致的任何法律争议和后果；
		<br>
		（4）因不可抗力而引起的任何后果。
		<br>
		根据《中华人民共和国宪法》和相关法律法规规定，在保护公民合法言论自由的同时，禁止利用互联网、通讯工具、媒体以及其他方式从事以下行为：
		<br>
		1. 组织、煽动抗拒、破坏宪法和法律、法规实施的。
		<br>
		2. 捏造或者歪曲事实，散布谣言，妨害社会管理秩序的。
		<br>
		3. 组织、煽动非法集会、游行、示威、扰乱公共场所秩序的。
		<br>
		4. 从事其他侵犯国家、社会、集体利益和公民合法权益的。
		<br>
		管理部门将依法严加监管上述行为并予以处理；对构成犯罪的，司法机关将追究刑事责任。
		<br>
		 附件一
		 <br>
		 《用户注销协议》
		 <br>
		 在您注销您的账户之前，请充分阅读、理解并同意下列事项：
		 <br>
		       我们在此善意地提醒您，您注销账户的行为会给您的售后维权带来诸多不便，且注销追风账户后，您的个人信息我们只会在追风租车的前台系统中去除，使其保持不可被检索、访问的状态，或对其进行匿名化处理。您知晓并理解，根据相关法律规定，相关交易记录须在追风后台保存5年甚至更长的时间。
			   <br>
		1. 如果您仍执意注销账户，您的账户需同时满足以下条件：
		<br>
		（1）账户在追风租车系统中无资产、无欠款；
		<br>
		（2）账户内无未完成的订单、已提供服务但未支付的订单/服务； 
		<br>
		（3）账户无任何纠纷，包括投诉举报或被投诉举报；
		<br>
		（4）账户为正常使用中的账户且无任何账户被限制的记录；
		<br>
		（5）账户对应的追风支付账户已注销，且已妥善处理了追风支付账户下的所有问题；
		<br>
		2.在追风租车账户注销期间，如果您的追风租车账户涉及争议纠纷，包括但不限于投诉、举报、诉讼、仲裁、国家有权机关调查等，追风租车有权自行终止本追风租车账户的注销而无需另行得到您的同意。
		<br>
		3.请您在提交注销申请前，务必解绑其他相关账户，具体可与我们的客服联系。
		<br>
		4. 追风租车账户一旦被注销将不可恢复，请您在操作之前自行备份账户相关的所有信息和数据。注销追风租车账户，您将无法再使用本追风租车账户，也将无法找回您追风租车账户中及与账户相关的任何内容或信息（即使您使用相同的手机号码再次注册并使用追风租车），包括但不限于：
		<br>
		（1）您将无法登录、使用追风租车账户；
		<br>
		（2）追风租车账户的个人资料和历史信息（包括但不限于用户名、昵称、头像、预定/团购记录等）都将无法找回；
		<br>
		（3）您通过追风租车账号进行登录的追风租车旗下各网站\小程序所有记录将无法找回。您将无法再登录、使用前述服务，您曾获得的优惠券、积分、及其他卡券等视为您自行放弃，将无法继续使用。您理解并同意，追风租车无法协助您重新恢复前述服务。
		<br>
		5. 注销本追风租车账户并不代表本追风租车账户注销前的账户行为和相关责任得到豁免或减轻。
		<br>
		特别提示：
		<br>
		为了保障您的合法权益，请您务必完整阅读并充分理解本授权书；若您不接受本授权书的任何条款，请您立即终止授权。
		本授权书一经出具即生效，本授权书是本人真实意思表示，本人同意承担由此带来的一切法律后果。
		<br>
		本人【租业业务实际需求人员】拟向贵司申请【信用租车】业务，鉴于贵司在业务审查、审批或者业务达成的过程中需要收集及使用本人信息，本人已充分知悉并明确授权：
		<br>
		（一）为保证贵司正常提供前述业务及本人的正常使用，贵司有权采集并使用本人以下个人信息：
		<br>
		个人基本信息/身份信息：本人使用贵司的网站或客户端提供的业务的过程中，为完成账户注册、身份核验以及正常使用贵司提供的业务而提交的信息。例如姓名、电话号码、性别、身份证、驾驶证等；
		<br>
		设备信息：根据本人授予的具体权限，采集并记录本人所使用的设备相关信息（包括设备型号、操作系统版本、国际移动用户识别码、SIM卡序列号、应用包名、应用版本号、国际移动设备识别码、设备环境等软硬件特征信息）、设备所在位置相关信息（包括GPS位置以及WLAN接入点、蓝牙等传感器信息）；
		<br>
		日志信息：本人使用贵司的网站或客户端提供的业务的过程中，产生的网络日志信息。例如本人的搜索查询内容、浏览器的类型、使用的语言、访问日期和时间及本人访问的网页记录等；
		<br>
		业务记录：因本人使用贵司业务产生的其他信息。
		<br>
		（二）鉴于贵司为本人提供前述业务中风险管控（如反欺诈和信贷审核）的必要，本人同意贵司有权视业务开展的实际情况，向合作的第三方风控服务商共享本授权书第（一）条中所述的本人个人信息，以完成前述必要的风险管控流程。
		<br>
		（三）本人进一步同意，在协助贵司完成前述必要的风险管控流程时，第三方风控服务商有权在合理、必要范围内：
		<br>
		3.1 对贵司提供的本人个人信息进行保存、加工、处理、关联和使用；
		<br>
		3.2 向合法存有本人个人信息的机构（含第三方风控服务商）查询、核验本人个人信息；
		<br>
		3.3 通过SDK（software develop kit）等方式收集本人的设备信息，并对该等信息进行保存、加工、处理、关联和使用；
		<br>
		3.4 对基于本授权书第3.1、3.2和3.3条收集、查询到的本人的个人信息进行分析和处理，出具相关报告并向贵司提供，法律法规、监管政策禁止的除外。
		<br>
		（四）本人进一步明确授权，为持续向本人提供前述业务及业务相关服务之目的，贵司与合作的第三方风控服务商有权保存、使用本人相关个人信息。
		<br>
		
		本人在此声明：
		<br>
		本人已充分理解上述授权条款的含义，明确知晓并自愿承担因上述信息处理活动可能对本人的业务评估结果所产生的不利影响，充分了解该等信息处理活动依赖互联网开展而互联网环境并非绝对安全，本人仍同意上述授权。
		<br>
		贵司已经对【信用租车】业务的相关事宜与风险向本人进行充分披露及说明，本人已知晓并同意。
		<br>
		本人承诺并保证，本人在本授权书项下所提供的所有信息真实、准确、完整、有效，且不会侵犯任何第三方的合法权利。
		<br>                                         

	</view>
</template>

<script>
</script>

<style lang="scss">
	@import '@/static/scss/_mixin.scss';
	.user-agreement {
		padding: 40rpx;
		@include text-both;
		@include font-set(28rpx, #000);
		line-height: 48rpx;
		
		.title {
			@include flex-center;
			@include font-set(32rpx, #000, 700);
			line-height: 58rpx;
			margin-bottom: 10rpx;
		}
		.sub-title {
			@include flex-center;
			@include font-set(32rpx, #000, 700);
			line-height: 58rpx;
			margin-bottom: 20rpx;
		}
	}
</style>
